[
    {
        "id": 1,
        "naziv": "Sampita.-.",
        "oprema": [
            0
        ],
        "sastojci": {
            "0": 10,
            "1": 300
        },
        "kategorije": [],
        "ocena": 0,
        "ekstenzijaSlike": "jpg",
        "opis": "Najsladji kolac ikadaaaa"
    },
    {
        "id": 2,
        "naziv": "Krempita",
        "oprema": [
            1
        ],
        "sastojci": {},
        "kategorije": [
            0,
            1
        ],
        "ocena": 0,
        "ekstenzijaSlike": "jpg",
        "opis": "Kolac sa najvise slasti poznat svima od malena. Vrlo jednostavna priprema a pri tome kolac koji ce sigurno zadovoljiti svaciji ukus"
    },
    {
        "id": 3,
        "naziv": "makarone",
        "oprema": [],
        "sastojci": {},
        "kategorije": [
            2,
            0
        ],
        "ocena": 0,
        "ekstenzijaSlike": "jpg",
        "opis": "slano ukusno jelo. jednostavna priprema."
    },
    {
        "id": 4,
        "naziv": "Jaje na oko",
        "oprema": [],
        "sastojci": {},
        "kategorije": [
            0
        ],
        "ocena": 0,
        "ekstenzijaSlike": "jpeg",
        "opis": "brzi dorucak"
    },
    {
        "id": 5,
        "naziv": "Piletina",
        "oprema": [],
        "sastojci": {},
        "kategorije": [
            0
        ],
        "ocena": 0,
        "ekstenzijaSlike": "jpeg",
        "opis": "Glavno jelo za posebne prilike"
    },
    {
        "id": 6,
        "naziv": "Hladna voda.-.",
        "oprema": [
            8
        ],
        "sastojci": {
            "2": 30.0,
            "3": 15.0
        },
        "kategorije": [],
        "ocena": 0,
        "ekstenzijaSlike": "jpg",
        "opis": "Doda se casa vode i to je to"
    },
    {
        "id": 7,
        "naziv": "Kapricoza pica",
        "oprema": [
            9,
            10
        ],
        "sastojci": {
            "4": 300.0,
            "5": 950.0,
            "2": 5.0,
            "6": 0.8,
            "7": 2.0,
            "8": 0.5
        },
        "kategorije": [
            0,
            4
        ],
        "ocena": 0,
        "ekstenzijaSlike": "jpg",
        "opis": "U toploj vodi vodi staviti kašičicu šećera i izdrobiti kvasac. Sačekati da naraste. U brašno staviti so, ostatak šećera, ulje, i vodu sa kvascem. Umesiti testo (ako je potrebno dodati još brašna). Podeliti testo na 2 dela i ostaviti da naraste (odprilike 15-ak minuta).\n\n2\nOba pleha dobro premazati uljem (da se ne bi testo zalepilo) i razvući testo rukama. Po testu sipatu kečap i ravnomerno razmazati.\n\n3\nZatim staviti: šunku (na polukrugove), čajnu kobasicu, slaninicu, pečurke (na listiće), masline (količina po želji). Na svaku 1/8 testa rabiti jaje (po želji). Posuti sa origanom i obilno nastrugati kačkavalj.\n\n4\nStaviti da se peče u prethodno zagrejanu rernu na 190 stepeni."
    },
    {
        "id": 8,
        "naziv": "Pecena piletina.-.",
        "oprema": [
            10
        ],
        "sastojci": {
            "9": 250.0,
            "10": 0.75,
            "2": 25.0,
            "11": 250.0
        },
        "kategorije": [],
        "ocena": 0,
        "ekstenzijaSlike": "jpg",
        "opis": "Piletinu operite i posušite papirnatim ubrusom. Zajedno pomiješajte sol, Vegetu Natur za piletinu i čili, pa s tom mješavinom dobro natrljajte piletinu. 2. Tepsiju (32x17 cm) lagano premažite uljem i u nju posložite piletinu tako da kožica bude okrenuta prema gore. 3. Piletinu prelijte s ostatkom ulja i stavite peći u prethodno zagrijanu pećnicu na 180 °C i pecite 80 minuta. Piletinu ni u kom slučaju nemojte okretati kako bi se kožica zarumenila i postala hrskava. 4. Vodu pustite da zakuha, pa dodajte kokošju kocku, sol i pustite da lagano kuha 5 minuta. Dodajte tijesto i kad je kuhano ocijedite ga, isperite, a dio tekućine sačuvajte."
    },
    {
        "id": 9,
        "naziv": "Piletina u lisnatom tijestu",
        "oprema": [
            10
        ],
        "sastojci": {
            "12": 250.0,
            "13": 250.0,
            "0": 3.0,
            "14": 250.0
        },
        "kategorije": [
            0,
            5
        ],
        "ocena": 0,
        "ekstenzijaSlike": "jpg",
        "opis": "\nPiletinu iseći na kockice, začiniti, pa pržiti na ulju. Kada je ispržena, izvaditi je iz tiganja pa u istom ulju propržiti sitno seckan luk i šampinjone. Posoliti po ukusu. Kada bude gotovo, u tiganj vratiti piletinu pa na tihoj vatri pržiti.\n\n2\nU posudi razmutiti dva jaja, pa dodati pavlaku za kuvanje. Sve sjediniti, pa preliti smesu u tiganju. Sve zajedno pržiti nekoliko minuta i onda skinuti sa vatre.\n\n3\nLisnato testo rasklagijati što tanje, i odprilike u obliku vaše posude za pečenje.\n\n4\nU vatrostalnu posudu sipati smesu iz tiganja, pa prekriti lisnatim testom. Peći 30 minuta na 200 stepeni. Kada je pečenje odprilike na pola, onda razmutiti preostalo jaje i premazati lisnato testo. Vratiti nakon toga odmah u šporet da se dopeče"
    }
]