[
    {
        "id": 0,
        "naziv": "Linolada sa malinama",
        "oprema": [],
        "sastojci": {
            "3": 200.0,
            "4": 150.0,
            "1": 100.0,
            "5": 250.0,
            "6": 60.0,
            "7": 130.0,
            "8": 1.0
        },
        "kategorije": [
            1,
            0
        ],
        "ocena": {
            "vrednost": 0,
            "brojOcena": 0,
            "kuvari": []
        },
        "ekstenzijaSlike": "jpg",
        "opis": "Maline samljeti pa ih pomje sa secerom i jogurtom.\n\nMaskarpone sjediniti sa Lino ladom, sirom i vanilinim secerom, dobro izmjesat.\nPripremiti 3-4 case zavisi od velicine Kod mene su bile malo vece. Na dno redjati malina smjesu preko sir smjesu pa Po vrhu jos ukrasiti sa malo malina smjesom.\nPreko stavljati svjeze maline i ribanu cokoladu."
    },
    {
        "id": 1,
        "naziv": "Pizza",
        "oprema": [
            1
        ],
        "sastojci": {
            "0": 950.0,
            "9": 5.0,
            "10": 0.8,
            "2": 10.0,
            "1": 10.0,
            "11": 10.0,
            "12": 300.0,
            "13": 200.0,
            "14": 1.0,
            "15": 3.0,
            "16": 300.0,
            "17": 1.0
        },
        "kategorije": [
            2,
            3
        ],
        "ocena": {
            "vrednost": 0,
            "brojOcena": 0,
            "kuvari": []
        },
        "ekstenzijaSlike": "jpg",
        "opis": "U toploj vodi vodi staviti kašičicu šećera i izdrobiti kvasac. Sačekati da naraste. U brašno staviti so, ostatak šećera, ulje, i vodu sa kvascem. Umesiti testo (ako je potrebno dodati još brašna). Podeliti testo na 2 dela i ostaviti da naraste (odprilike 15-ak minuta).Oba pleha dobro premazati uljem (da se ne bi testo zalepilo) i razvući testo rukama. Po testu sipatu kečap i ravnomerno razmazati.Zatim staviti: šunku (na polukrugove), čajnu kobasicu, slaninicu, pečurke (na listiće), masline (količina po želji). Na svaku 1/8 testa rabiti jaje (po želji). Posuti sa origanom i obilno nastrugati kačkavalj.Staviti da se peče u prethodno zagrejanu rernu na 190 stepeni."
    },
    {
        "id": 2,
        "naziv": "Sampita",
        "oprema": [
            1
        ],
        "sastojci": {
            "18": 7.0,
            "1": 100.0,
            "19": 0.7,
            "10": 0.7
        },
        "kategorije": [
            0,
            4
        ],
        "ocena": {
            "vrednost": 0,
            "brojOcena": 0,
            "kuvari": []
        },
        "ekstenzijaSlike": "jpg",
        "opis": "Zumanjke i secer mijesajte dok se secer ne otopi. Dodajte mlijeko, ulje i brasno pomijesano s praskom za pecivo.\nSmjesu dobro izmijesajte i izlijte u namasceni pobrasnjeni lim za pecenje (30 x 20 cm) te pecite u pecnici zagrijanoj na 200°C 10 minuta.\n3.Saum nanesite preko pecenog biskvita, poravnajte i vratite u pecnicu na 5 minuta (da se formira korica).\nOhladite na sobnoj temperaturi, a zatim nastavite hladiti u hladnjaku.\nZa Saum:\nSecer i vodu zagrijte na srednjoj temperaturi dok se secer ne otopi i pocne formirati mjehurice.\nBjelanjke istucite u cvrsti snijeg (kad okrenete posudu naopacke da saum ne ispadne).\nPolako dodavajte vrci, rastopljeni secer uz stalno mijesanje i tako nastavite jos 15 minuta.\nNa kraju sampitu vratite u iskljucenu rernu kako bi se na saumu uhvatila korica, sampita ce se lakse rezati."
    },
    {
        "id": 3,
        "naziv": "Taljatele sa piletinom",
        "oprema": [
            2,
            3
        ],
        "sastojci": {
            "20": 300.0,
            "21": 100.0,
            "22": 400.0,
            "2": 5.0,
            "23": 5.0,
            "24": 1.0,
            "25": 2.0
        },
        "kategorije": [
            2
        ],
        "ocena": {
            "vrednost": 9.0,
            "brojOcena": 1,
            "kuvari": [
                "andros"
            ]
        },
        "ekstenzijaSlike": "jpg",
        "opis": "Na maslinovom ulju isprziti komadice belog mesa i pred kraj przenja dodati sitno nasecenu tikvicu i paprike. zaciniti solju i vegetom. Dodati pavlaku. kuvati jos 5 minuta na umerenoj vatri. U dubokoj serpi skuvati taljatele u posoljenoj vodi. Kada su taljatele gotove ubaciti ih u posudu, ja koristim vok,sa pripremljenim prelivom i promesati! Po zelji dodati parmezan ili drugi omiljeni sir! Prijatno."
    },
    {
        "id": 4,
        "naziv": "Tart sa malinama",
        "oprema": [
            1
        ],
        "sastojci": {
            "0": 220.0,
            "26": 60.0,
            "27": 150.0,
            "28": 4.0,
            "29": 1.0,
            "30": 300.0,
            "31": 2.0
        },
        "kategorije": [
            0
        ],
        "ocena": {
            "vrednost": 0,
            "brojOcena": 0,
            "kuvari": []
        },
        "ekstenzijaSlike": "jpg",
        "opis": "Zamesiti testo od brasna, margarina, secera i zumanca. Testo peci 25 minuta na 180 stepeni. U serpi prokuvati maline, secer i 4 kasike vode. Kada prokuva, dodati gustin razmucen sa vodom i kuvati dok se ne zgusne. Kada se dovoljno zgusne rasporediti fil preko testa. Rastopiti cokoladu sa slatkom pavlakom i prelijte preko kolaca. Ostaviti u frizideru 3 sata, zatim posluziti."
    }
]